/******************************************************************************
* 版权所有 (C)2013,Nanjing Shufan Information Technology Co.,Ltd.
*
* 文件名称：Knx_AlMgm.h
* 文件标识：无
* 内容摘要：knx ip application layer management header file.
* 其他说明：
* 当前版本：V1.00
* 作    者：Jackson
* 完成日期：2014年3月18日
*    
* 修改记录1：
*        修改日期：2014年3月18日
*        版 本 号：V1.00
*        修 改 人：Jackson
*        修改内容：创建文件
******************************************************************************/


#ifndef _KNX_ALMGM_H_
#define _KNX_ALMGM_H_

#ifdef __cplusplus
extern "C" {
#endif



/**************************************************************************************************************
* 函数名称：VOID Knx_AlMgmUp(BYTE **pucUpFrame)
* 功能描述：KNX application layer management up frames handle。
* 输入参数：BYTE **pucUpFrame:up frame buffer's pointer,*pucUpFrame points to the header of buffer.
* 输出参数：no.
* 返 回 值：no.
* 其它说明：if we handle over the frames,we set the length of the buffer to clear it.
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
VOID Knx_AlMgmUp(BYTE **pucUpFrame);

/**************************************************************************************************************
* 函数名称：VOID Knx_AlMgmInit(VOID)
* 功能描述：KNX application layer management initialize。
* 输入参数：no.
* 输出参数：no.
* 返 回 值：no.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
VOID Knx_AlMgmInit(VOID);

/**************************************************************************************************************
* 函数名称：static BOOL KnxAl_ApduLengthCheck(BYTE *pucUpFrame,BYTE ucLength)
* 功能描述：check if the APDU length is right.
* 输入参数：BYTE *pucUpFrame:up frame buffer's pointer.
            BYTE ucLength   :the right length to meassure the APDU length.
* 输出参数：no.
* 返 回 值：TRUE : the length is right.
            FALSE: the length is wrong.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
BOOL KnxAl_ApduLengthCheck(BYTE *pucUpFrame,BYTE ucLength);

/**************************************************************************************************************
* 函数名称：BYTE *KnxAl_GetMgmDownFrame(VOID)
* 功能描述：get the management down frame.
* 输入参数：no.
* 输出参数：no.
* 返 回 值：BYTE *:down frame buffer pointer.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
BYTE *KnxAl_GetMgmDownFrame(VOID);

/**************************************************************************************************************
* 函数名称：VOID KnxAl_CompleteRespReq(BYTE *pucUpFrame,BYTE *pucDwFrame)
* 功能描述：complete the response frame.
* 输入参数：BYTE *pucUpFrame : in frame's buffer.
            BYTE *pucDwFrame : down frame's buffer.
* 输出参数：no.
* 返 回 值：no.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
VOID KnxAl_CompleteRespReq(BYTE *pucUpFrame,BYTE *pucDwFrame);

/**************************************************************************************************************
* 函数名称：VOID KnxAl_SetDeviceControl(BYTE ucDevCtrl)
* 功能描述：set device control data.
* 输入参数：BYTE ucDevCtrl.
* 输出参数：no.
* 返 回 值：no.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
VOID KnxAl_SetDeviceControl(BYTE ucDevCtrl);

/**************************************************************************************************************
* 函数名称：BYTE KnxAl_GetDeviceCtrl(VOID)
* 功能描述：get device control data.
* 输入参数：no.
* 输出参数：no.
* 返 回 值：BYTE : sg_ucDevCtrl.
* 其它说明：
* 修改日期     版本号     修改人      修改内容
* -------------------------------------------------------------------------------------------------------------
* 2014-03-20   V1.00                   创建
***************************************************************************************************************/
BYTE KnxAl_GetDeviceCtrl(VOID);







#ifdef __cplusplus
}
#endif

#endif /* _KNX_ALMGM_H_ */



/* end of file. */


